[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:6:83
 import { useNavigate } from 'react-router-dom';
 
 
-function RecommendationRequestForm({ initialContents, submitAction, buttonLabel = "Create" }) {
+function RecommendationRequestForm({ initialContents, submitAction, buttonLabel = "" }) {
 
   
killedBy: RecommendationRequestForm tests renders correctly with no initialContents
statusReason: Error: Unable to find an element with the text: /Create/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:52:51
                    id="requesterEmail"
                    type="text"
                    isInvalid={Boolean(errors.requesterEmail)}
-                   {...register("requesterEmail", {
-                       required: "RequesterEmail is required."
-                   })}
+                   {...register("requesterEmail", {})}
                />
                <Form.Control.Feedback type="invalid">
killedBy: RecommendationRequestForm tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /RequesterEmail is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:103:50
                    id="dateRequested"
                    type="datetime-local"
                    isInvalid={Boolean(errors.dateRequested)}
-                   {...register("dateRequested", { required: true, pattern: isodate_regex })}
+                   {...register("dateRequested", {})}
                />
                <Form.Control.Feedback type="invalid">
killedBy: RecommendationRequestForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /DateRequested is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
