[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:12:20
 export default function RecommendationRequestTable({ 
     recommendationRequest,
     currentUser,
-    testIdPrefix = "RecommendationRequestTable"}) {
+    testIdPrefix = ""}) {
 
     const navigate = useNavigate();
killedBy: RecommendationRequestTable tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RecommendationRequestTable-cell-row-0-col-id"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:44:23
         },
         {
             Header: 'ProfessorEmail',
-            accessor: 'professorEmail',
+            accessor: "",
         },
         {
killedBy: RecommendationRequestTable tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RecommendationRequestTable-cell-row-0-col-professorEmail"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:50:9
             Header: 'Explanation',
             accessor: 'explanation',
         },
-        {
-            Header: 'DateRequested',
-            accessor: 'dateRequested',
-        },
+        {},
         {
             Header: 'DateNeeded',
killedBy: RecommendationRequestTable tests renders empty table correctly
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:52:23
         },
         {
             Header: 'DateRequested',
-            accessor: 'dateRequested',
+            accessor: "",
         },
         {
killedBy: RecommendationRequestTable tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RecommendationRequestTable-cell-row-0-col-dateRequested"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:60:23
         },
         {
             Header: 'Done',
-            accessor: 'done',
+            accessor: "",
         }
     ];
killedBy: RecommendationRequestTable tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RecommendationRequestTable-cell-row-0-col-done"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] BlockStatement
main/components/RecommendationRequest/RecommendationRequestTable.js:64:45
         }
     ];
 
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-        columns.push(ButtonColumn("Edit", "primary", editCallback, "RecommendationRequestTable"));
-        columns.push(ButtonColumn("Delete", "danger", deleteCallback, "RecommendationRequestTable"));
-    } 
+    if (hasRole(currentUser, "ROLE_ADMIN")) {} 
 
     return <OurTable
killedBy: RecommendationRequestTable tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RecommendationRequestTable-cell-row-0-col-Edit-button"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:65:35
     ];
 
     if (hasRole(currentUser, "ROLE_ADMIN")) {
-        columns.push(ButtonColumn("Edit", "primary", editCallback, "RecommendationRequestTable"));
+        columns.push(ButtonColumn("", "primary", editCallback, "RecommendationRequestTable"));
         columns.push(ButtonColumn("Delete", "danger", deleteCallback, "RecommendationRequestTable"));
     } 
killedBy: RecommendationRequestTable tests renders empty table correctly
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:66:35
 
     if (hasRole(currentUser, "ROLE_ADMIN")) {
         columns.push(ButtonColumn("Edit", "primary", editCallback, "RecommendationRequestTable"));
-        columns.push(ButtonColumn("Delete", "danger", deleteCallback, "RecommendationRequestTable"));
+        columns.push(ButtonColumn("", "danger", deleteCallback, "RecommendationRequestTable"));
     } 
 
killedBy: RecommendationRequestTable tests renders empty table correctly
statusReason: Error: A column ID (or string accessor) is required!
