[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:56:52
                             id="itemId"
                             type="number"
                             isInvalid={Boolean(errors.itemId)}
-                            {...register("itemId", { required: true, min: 1 })}
+                            {...register("itemId", {})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests Correct Error messsages on bad input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Item ID must be positive/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] OptionalChaining
main/components/MenuItemReview/MenuItemReviewForm.js:60:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.itemId && 'Item ID is required. '}
-                            {errors.itemId?.type === 'min' && 'Item ID must be positive'}
+                            {errors.itemId.type === 'min' && 'Item ID must be positive'}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: MenuItemReviewForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'type')

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:60:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.itemId && 'Item ID is required. '}
-                            {errors.itemId?.type === 'min' && 'Item ID must be positive'}
+                            {true}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: MenuItemReviewForm tests Correct Error messsages on bad input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Item ID must be positive/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] OptionalChaining
main/components/MenuItemReview/MenuItemReviewForm.js:95:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.reviewerEmail && 'Reviewer email is required.'}
-                            {errors.reviewerEmail?.type === 'pattern' && 'Reviewer email format invalid'}
+                            {errors.reviewerEmail.type === 'pattern' && 'Reviewer email format invalid'}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: MenuItemReviewForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'type')

[Killed] LogicalOperator
main/components/MenuItemReview/MenuItemReviewForm.js:95:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.reviewerEmail && 'Reviewer email is required.'}
-                            {errors.reviewerEmail?.type === 'pattern' && 'Reviewer email format invalid'}
+                            {errors.reviewerEmail?.type === 'pattern' || 'Reviewer email format invalid'}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: MenuItemReviewForm tests No Error messsages on good input
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div class="invalid-feedback">Reviewer email format invalid</div> instead

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:107:42
                             id="stars"
                             type="number"
                             isInvalid={Boolean(errors.stars)}
-                            {...register("stars", { required: true, min: 0, max: 5 })}
+                            {...register("", { required: true, min: 0, max: 5 })}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:111:31
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.stars && 'Stars is required. '}
-                            {(errors.stars?.type === 'min' || errors.stars?.type === 'max') && 'Stars need to be in range 0 - 5'}
+                            {(true) && 'Stars need to be in range 0 - 5'}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: MenuItemReviewForm tests No Error messsages on good input
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div class="invalid-feedback">Stars need to be in range 0 - 5</div> instead

[Killed] LogicalOperator
main/components/MenuItemReview/MenuItemReviewForm.js:111:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.stars && 'Stars is required. '}
-                            {(errors.stars?.type === 'min' || errors.stars?.type === 'max') && 'Stars need to be in range 0 - 5'}
+                            {errors.stars?.type === 'min' || errors.stars?.type === 'max' || 'Stars need to be in range 0 - 5'}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: MenuItemReviewForm tests Correct Error messsages on bad input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Stars need to be in range 0 - 5/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:127:42
                             id="comments"
                             type="text"
                             isInvalid={Boolean(errors.comments)}
-                            {...register("comments", { required: true })}
+                            {...register("", { required: true })}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')
