[Survived] BooleanLiteral
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.js:8:70
 import { useBackend, useBackendMutation } from "main/utils/useBackend";
 import { toast } from "react-toastify";
 
-export default function UCSBDiningCommansMenuItemEditPage({storybook=false}) {
+export default function UCSBDiningCommansMenuItemEditPage({storybook=true}) {
     let { id } = useParams();
 

[Survived] ArrowFunction
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.js:24:36
             }
         );
 
-    const objectToAxiosPutParams = (item) => ({
-        url: "/api/ucsbdiningcommonsmenuitem",
-        method: "PUT",
-        params: {
-            id: item.id,
-        },
-        data: {
-            diningcommonscode: item.diningcommonscode,
-            name: item.name,
-            station: item.station,
-        }
-    });
+    const objectToAxiosPutParams = () => undefined;
 
     const onSuccess = (item) => {

[Survived] BlockStatement
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemEditPage.js:37:33
         }
     });
 
-    const onSuccess = (item) => {
-        toast(`RestauItemrant Updated - id: ${item.id} name: ${item.name}`);
-    }
+    const onSuccess = (item) => {}
 
     const mutation = useBackendMutation(
