[Survived] BlockStatement
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemCreatePage.js:3:47
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function UCSBDatesCreatePage() {
-
-  // Stryker disable all : placeholder for future implementation
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Create page not yet implemented</h1>
-      </div>
-    </BasicLayout>
-  )
-}
+export default function UCSBDatesCreatePage() {}
 
